*** Сборка

Для работы требуется virtualenv.
#+BEGIN_SRC sh
virtualenv ~/.ve/json-log --python=python3
#+END_SRC

#+RESULTS:
: Already using interpreter /usr/bin/python3
: Using base prefix '/usr'
: New python executable in /home/amadev/.ve/json-log/bin/python3
: Not overwriting existing python script /home/amadev/.ve/json-log/bin/python (you must use /home/amadev/.ve/json-log/bin/python3)
: Installing setuptools, pip, wheel...done.

Зависимости.
#+BEGIN_SRC sh
~/.ve/json-log/bin/pip install jinja2
#+END_SRC

#+RESULTS:

Общий код.
#+BEGIN_SRC python :noweb yes :tangle json-log.py
  #!/usr/bin/env python
  # AUTO generated source
  import re
  import os
  import sys
  import json
  import argparse
  from jinja2 import Environment


  <<formatter>>


  <<main>>


  <<filter>>


  if __name__ == '__main__':
      try:
          options = parse_options()
          template = read_template(options.format)
          log_filter = create_log_filter(parse_filter(options.filter))
          main()
      except Exception as err:
          print('error: {} ({})'.format(err, type(err)), file=sys.stderr)
          sys.exit(1)
#+END_SRC

#+RESULTS:

Запуск smoke-теста.
#+BEGIN_SRC sh
cat log.txt | python3 json-log.py --filter '@fields.level=INFO'
#+END_SRC

#+RESULTS:
: [2015-12-15T05:45:39+00:00] INFO
: [2015-12-15T05:45:39+00:00] INFO
